var locs_name = ["제주공항", "어승생승마장", "고집돌우럭-점심", "함덕해수욕장", "델문도-카페", "봄그리고가을리조트", "성산풍천장어-저녁", "우도잠수함", "오조조개체험",
                    "성산일출봉", "낙타트레킹","카트레이싱", "녹차한잔", "샤오츠-점심", "빛의벙커", "제주카약체험장", "성산갈치-저녁",
                    "제주해양동물박물관", "비자림", "비자림길-점심", "만장굴", "김녕미로공원", "돈사돈-저녁"
                ];

var locs_type = [0, 1, 1, 1, 1, 0, 2, 1, 1, 
                2, 2, 2, 2, 2, 2, 2, 1,
                3, 3, 3, 3, 3, 3];

var locs_file_name = ["제주공항.jpg", "어승생승마장.jpg", "고집돌우럭.jpg", "함덕해수욕장.jpg", "델문도.jpg", "봄그리고가을.jpg", "성산풍천장어.jpg",  "우도잠수함.jpg", "오조조개체험.jpg",
                    "성산일출봉.jpg", "낙타트레킹.jpg", "카트레이싱.jpg", "녹차한잔.jpg", "샤오츠.jpg", "빛의벙커.jpg", "제주카약.gif", "제주성산갈치.jpg",
                    "제주해양동물박물관.jpg", "비자림.jpg", "비자림길.jpg", "만장굴.jpg", "김녕미로공원.jpg", "돈사돈.jpg"
                    ];                        


var locs_link = ['https://blog.naver.com/love386600/222656771073' , //제주공항
                    'https://blog.naver.com/labok0418/222702033782' , //어승생승마장
                    'https://blog.naver.com/kimyeji901030/221983576859', //고집돌우럭
                    'https://blog.naver.com/hhome1/222706383980', //함덕해수욕장
                    'https://blog.naver.com/hobak2ey/222696029910', //데문도 가페

                    'https://blog.naver.com/tvfxq0153/222711340826', //봄그리고가을리조트
                    'https://blog.naver.com/mani4536/221402922678', //성산풍천장어
                    'https://blog.naver.com/wetbell1/222428293639', //우도잠수함

                    'https://blog.naver.com/kst0712/221738382915', //성산일출봉
                    'https://blog.naver.com/01027997153/222293347724', //제주낙타트레킹 (제주아리랑)
                    'https://blog.naver.com/2runnaln/222701919256', //카트레이싱
                    'https://blog.naver.com/suk110011/222667744738', //녹차한잔_족욕체험
                    'https://blog.naver.com/ecopic2015/222634657185', //샤오츠-점심
                    'https://blog.naver.com/parangusl_/222593058393', //빛의벙커
                    'https://blog.naver.com/cyberbinpol/222487349774', //제주카약체험
                    'https://blog.naver.com/2ski2/222629980238', //성산갈치맛집-저녁
                    'https://blog.naver.com/bloomingjeju/222694066682', //오조조개체험


                    'https://blog.naver.com/hksh012/222542090241', //제주해양동물박물관
                    'https://blog.naver.com/ejin3j/222686652299', //비자림
                    'https://blog.naver.com/baeyujinavi/222673191040', //비자림길 -점심

                    'https://blog.naver.com/ultrabat/222614719551', //만장굴
                    'https://blog.naver.com/jtowelcome/222711965825', //김녕미로공원
                    'https://blog.naver.com/ppoby1004/222451099716', //돈사돈 월정점

]

var locs_detail_blog = ["제주공항 - 블로그", "(승마장) 어승생승마장 - 블로그", "(승마장) 고집돌우럭 - 블로그", "함덕해수욕장-블로그", "델문도 카페-블로그", "봄그리고가을리조트 - 블로그", "성산풍천장어 - 블로그","우도잠수함 - 블로그", "오조조개체험-블로그",
                        "성산일출봉 - 블로그", "낙타트레킹-블로그", "카트레이싱-블로그", "녹차한잔-족욕체험-블로그", "샤오츠-블로그", "빛의벙커-블로그", "제주카약체험장-블로그", "성산갈치맛집-블로그",
                        "제주해양동물박물관-블로그", "비자림-블로그", "비자림길 - 블로그", "만장굴-블로그", "김녕미로공원-블로그", "돈사돈-블로그"
                        ];

var locs_detail_address = ["제주시 공항로 2",                       //제주공항
                        "제주시 1100로 2659",                        // 어승재승마장
                        "제주시 조천읍 신북로 491-9",                   //고집돌우럭
                        "제주시 조천읍 함덕리 1004-5",                  //함덕해수욕장 주차장

                        "제주시 조천읍 함덕리 1008-1", //델문도-카페

                        "서귀포시 성산읍 해맞이해안로 2660",            //봄그리고가을리조트
                        "서귀포시 성산읍 신양로 8",                 //성산풍천장어
                        "서귀포시 성산읍 성산등용로 112-7",                //우도잠수함
                        "서귀포시 성산읍 오조리 2-4",                        //오조조개체험

                        "서귀포시 성산읍 일출로 284-12",                 //성산일출봉
                        "서귀포시 표선면 번영로 2564-21",                //제주 낙타트레킹 
                        "서귀포시 표선면 중산간동로 4778",                 //성읍랜드 ??? 오늘은카트레이싱>
                        "서귀포시 표선면 중산간동로 4772",              //녹차한잔_족욕체험
                        "서귀포시 성산읍 성산등용로17번길 55",             //샤오츠 - 점심
                        "서귀포시 특별자치도 성산읍 고성리 2039-22",      //빛의벙커
                        "제주특별시 구좌읍 하도리 43-6",                     //제주카약체험장
                        "서귀포시 성산읍 한도로 90",                        //성산갈치맛집

                        "서귀포시 성산읍 서성일로 689-21",              //제주해양동물박물관
                        "제주시 구좌읍 비자숲길 55",                     //비자림
                        "제주시 구좌읍 비자림로 2682",                  //비자림길
                        "제주시 구좌읍 만장굴길 182",                   //만장굴
                        "제주시 구좌읍 만장굴길 122",                   //김녕미로공원

                        "제주시 구좌읍 한동북1길 29-3",                 //돈사돈-저녁

                        ];


var locs_pos = [[33.50763941712983, 126.49098539385706],    // 제주공항
                [33.42571355053445, 126.49086027307811],    // 어승재승마장
                [33.54388299395961, 126.66334044977755],                   //고집돌우럭
                [33.5427678,126.6693816],                   //함덕해수욕장-주차장
                [33.54389441711143, 126.66891791679502],    //델문도-카페

                [33.47394833878163, 126.91072531190343],    //봄그리고가을리조트     
                [33.434837134454, 126.91061613765928],      //성산풍천장어               
                [33.472936293154554, 126.93419809691166],   //우도잠수함
                [33.468521343868396, 126.9235429830545],    //오조 조개체험

                [33.46063859468947, 126.93856332495794],    //성산일출봉
                [33.40255027439615, 126.7785212333992],     //제주낙타트레킹

                [33.38207518863781, 126.78995294680435],    //카트레이싱
                [33.38179015781185, 126.79110395672325],    //녹차한잔_족욕체험
                [33.45968087827381, 126.92935606623331],                   //샤오츠-점심

                [33.44004963315746, 126.8992344387855],    //빛의벙커
                [33.515138169368996, 126.90088277790554],                   //제주카약체험장
                [33.468447389808304, 126.91715783995144],                   //성산갈치맛집-저녁

                [33.42976513786587, 126.85524010527244],                   //제주해양동물박물관
                [33.491125293547896, 126.81077502340092],                   //비자림
                [33.52457570136198, 126.83722417521064],                   //비자림길
                [333.529409698284944, 126.7710532217457],                   //만장굴

                [33.53628418814327, 126.77216051462356],                   //김녕미로공원
                [33.54137063309806, 126.82739088242005],                   //돈사돈 월정점


];


