var plan_loc_info = [
                ['제주공항',        '제주공항.jpg',         0, '제주시 공항로 2',               [33.50763941712983, 126.49098539385706],  "https://blog.naver.com/love386600/222656771073"],
                ['어승생승마장',    '어승생승마장.jpg',     1, '제주시 1100로 2659',            [33.50763941712983, 126.49098539385706],  "https://blog.naver.com/labok0418/222702033782"],
                ['고집돌우럭-점심', '고집돌우럭.jpg',       1, '제주시 조천읍 신북로 491-9',    [33.54388299395961, 126.66334044977755],   "https://blog.naver.com/kimyeji901030/221983576859"],
                ['함덕해수욕장',    '함덕해수욕장.jpg',     1, '제주시 조천읍 함덕리 1004-5',   [33.5427678,126.6693816],                   "https://blog.naver.com/hhome1/222706383980"],
                ['델문도-카페',     '델문도.jpg',           1, '제주시 조천읍 함덕리 1008-1',   [33.54389441711143, 126.66891791679502],   "https://blog.naver.com/hobak2ey/222696029910"],
                ["봄그리고가을리조트", "봄그리고가을.jpg",  1, "서귀포시 성산읍 해맞이해안로 2660", [33.47394833878163, 126.91072531190343], 'https://blog.naver.com/tvfxq0153/222711340826'],
                ['성산풍천장어-저녁', '성산풍천장어.jpg',   1, "서귀포시 성산읍 신양로 8", [33.434837134454, 126.91061613765928], 'https://blog.naver.com/mani4536/221402922678'],
                ["우도잠수함",   "우도잠수함.jpg", 1, "서귀포시 성산읍 성산등용로 112-7", [33.472936293154554, 126.93419809691166], 'https://blog.naver.com/wetbell1/222428293639'], 
                ['오조조개체험', '오조조개체험.jpg', 1, '서귀포시 성산읍 오조리 2-4', [33.468521343868396, 126.9235429830545], 'https://blog.naver.com/bloomingjeju/222694066682'], 

                ['성산일출봉',       '성산일출봉.jpg',      2, '서귀포시 성산읍 일출로 284-12', [33.46063859468947, 126.93856332495794], 'https://blog.naver.com/kst0712/221738382915'],
                ['낙타트레킹',      '낙타트레킹.jpg',    2, '서귀포시 표선면 번영로 2564-21', [33.40255027439615, 126.7785212333992], 'https://blog.naver.com/01027997153/222293347724'],
                ['카트레이싱',      '카트레이싱.jpg',        2, '서귀포시 표선면 성읍리 2045-1', [33.39895687456664, 126.7869680582864], 'https://blog.naver.com/2runnaln/222701919256'],
                ['녹차한잔',    "녹차한잔.jpg",         2, "서귀포시 표선면 중산간동로 4772", [33.38179015781185, 126.79110395672325], 'https://blog.naver.com/suk110011/222667744738' ],
                ["샤오츠-점심", "샤오츠.jpg", 2, "서귀포시 성산읍 성산등용로17번길 55", [33.45968087827381, 126.92935606623331], 'https://blog.naver.com/ecopic2015/222634657185'],
                ["빛의벙커",  "빛의벙커.jpg", 2, "서귀포시 특별자치도 성산읍 고성리 2039-22", [33.44004963315746, 126.8992344387855], 'https://blog.naver.com/parangusl_/222593058393'],
                ['제주카약체험장',"제주카약.gif", 2,  "제주특별시 구좌읍 하도리 43-6", [33.515138169368996, 126.90088277790554], 'https://blog.naver.com/cyberbinpol/222487349774'],
                ["성산갈치-저녁", "제주성산갈치.jpg", 2,  "서귀포시 성산읍 한도로 90", [33.468447389808304, 126.91715783995144], 'https://blog.naver.com/2ski2/222629980238'],

                ['제주해양동물박물관',"제주해양동물박물관.jpg",  3, "서귀포시 성산읍 서성일로 689-21", [33.42976513786587, 126.85524010527244],  'https://blog.naver.com/hksh012/222542090241'],
                ["비자림", "비자림.jpg", 3, "제주시 구좌읍 비자숲길 55",  [33.491125293547896, 126.81077502340092], 'https://blog.naver.com/ejin3j/222686652299'],
                ["메이즈랜드", "메이즈랜드.jpg", 3,  "제주시 구좌읍 비자림로 2134-47", [33.48902728909952, 126.80100904717419],  'https://blog.naver.com/no1yoongoo/222712188282'],
                ["비자림길-점심", "비자림.jpg", 3 , "제주시 구좌읍 비자숲길 55", [33.491125293547896, 126.81077502340092], 'https://blog.naver.com/baeyujinavi/222673191040'],
                ["만장굴",  "만장굴.jpg", 3, "제주시 구좌읍 만장굴길 182", [33.529409698284944, 126.7710532217457],  'https://blog.naver.com/ultrabat/222614719551'],
                ["머문-카페", "머문.jpg", 3, "제주시 구좌읍 해맞이해안로 460", [33.55568245175562, 126.79590049170257], 'https://blog.naver.com/jjangqqq123/222364141610'],
                ["김녕미로공원", "김녕미로공원.jpg", 3, "제주시 구좌읍 만장굴길 122",  [33.53628418814327, 126.77216051462356], 'https://blog.naver.com/jtowelcome/222711965825'],
                ["돈사돈-저녁",  "돈사돈.jpg", 3, "제주시 구좌읍 한동북1길 29-3", [33.54137063309806, 126.82739088242005],  'https://blog.naver.com/ppoby1004/222451099716']
]

var real_loc_info = [
    ['빌리렌터카',        '빌리렌터카.jpg',       1, '제주시 이호일동 덕지2길 6',               [33.49401229326915, 126.44995190355544],  "https://blog.naver.com/jejuozen/222531116601"],
    ['어승생승마장',    '어승생승마장.jpg',     1, '제주시 1100로 2659',            [33.42564644197365, 126.49085198420356],  "https://blog.naver.com/labok0418/222702033782"],
    ['고집돌우럭-점심', '고집돌우럭.jpg',       1, '제주시 조천읍 신북로 491-9',    [33.54388299395961, 126.66334044977755],   "https://blog.naver.com/kimyeji901030/221983576859"],
    ['함덕해수욕장',    '함덕해수욕장.jpg',     1, '제주시 조천읍 함덕리 1004-5',   [33.543098676175546, 126.6646967028714],                   "https://blog.naver.com/hhome1/222706383980"],
    ["우도잠수함",   "우도잠수함.jpg", 1, "서귀포시 성산읍 성산등용로 112-7", [33.472936293154554, 126.93419809691166], 'https://blog.naver.com/wetbell1/222428293639'], 
    ["썬라이즈135",   "썬라이즈135.jpg", 1, "서귀포시 성산읍 시흥상동로 135", [33.480430398920426, 126.89718205946451], 'https://blog.naver.com/already2222/222663906140'], 

    ['성산봄죽칼국수-아침',      '성산봄죽칼국수.jpg',    2, '서귀포시 성산읍 해맞이해안로 2725', [33.47165679271395, 126.91714276947668], 'https://blog.naver.com/sysl87/222726029785'],
    ['낙타트레킹',      '낙타트레킹.jpg',    2, '서귀포시 표선면 번영로 2564-21', [33.40255027439615, 126.7785212333992], 'https://blog.naver.com/01027997153/222293347724'],
    ['카트레이싱',      '카트레이싱.jpg',        2, '서귀포시 표선면 성읍리 2045-1', [33.39895687456664, 126.7869680582864], 'https://blog.naver.com/2runnaln/222701919256'],
    ['녹차한잔',        "녹차한잔.jpg",         2, "서귀포시 표선면 중산간동로 4772", [33.38179015781185, 126.79110395672325], 'https://blog.naver.com/suk110011/222667744738' ],
    ["당포로나인-점심", "당포로나인.jpg", 2, "서귀포시 표선면 표선당포로 9", [33.3257353005594, 126.84362499980494], 'https://blog.naver.com/dew0023/222715259071'],
    ['표선해수욕장',    '표선해수욕장.jpg',     2, '서귀포시 표선면 표선리 483-1',   [33.32729083603709, 126.83784705163237], "https://blog.naver.com/dlaledma4915/222724568290"],
    ['오조조개체험',    '오조조개체험.jpg', 2, '서귀포시 성산읍 오조리 2-4', [33.468521343868396, 126.9235429830545], 'https://blog.naver.com/bloomingjeju/222694066682'], 

    ['꽃담수제버거-아침',      '꽃담수제버거.jpg',    3, '서귀포시 성산읍 일출로 284-7', [33.46320907150837, 126.93599157580512], 'https://blog.naver.com/sysl87/222726029785'],
    ['성산일출봉',       '성산일출봉.jpg',      3, '서귀포시 성산읍 일출로 284-12', [33.46063859468947, 126.93856332495794], 'https://blog.naver.com/kst0712/221738382915'],
    ["빛의벙커",  "빛의벙커.jpg", 3, "서귀포시 특별자치도 성산읍 고성리 2039-22", [33.44004963315746, 126.8992344387855], 'https://blog.naver.com/parangusl_/222593058393'],
    ["메이즈랜드", "메이즈랜드.jpg", 3,  "제주시 구좌읍 비자림로 2134-47", [33.48902728909952, 126.80100904717419],  'https://blog.naver.com/no1yoongoo/222712188282'],
    ["비자림길-점심", "비자림.jpg", 3 , "제주시 구좌읍 평대리 1561-1", [33.52448659495915, 126.83711595377093], 'https://blog.naver.com/baeyujinavi/222673191040'],
    ["만장굴",  "만장굴.jpg", 3, "제주시 구좌읍 만장굴길 182", [33.529409698284944, 126.7710532217457],  'https://blog.naver.com/ultrabat/222614719551'],
    ["카페라라라", "카페라라라.jpg", 3, "제주시 구좌읍 해맞이해안로 1430", [33.52486417298823, 126.85808770811629], 'https://blog.naver.com/91_twinkle/222684051439'],
    ["굽네치킨-저녁",  "굽네치킨.jpg", 3, "성산읍 해맞이해안로 2652", [33.47446387667813, 126.91115479706609],  'https://blog.naver.com/wodnjsdhqk/222012246687'],

    ['제주공항',        '제주공항.jpg',         0, '제주시 공항로 2',               [33.50763941712983, 126.49098539385706],  "https://blog.naver.com/love386600/222656771073"],
    ["봄그리고가을리조트", "봄그리고가을.jpg",  0, "서귀포시 성산읍 해맞이해안로 2660", [33.47394833878163, 126.91072531190343], 'https://blog.naver.com/tvfxq0153/222711340826'],
]

clickList = [true, true, true, true]

function checkButton(mode){
    console.log("button clicked!!")
    //mode = document.getElementById(this).getAttribute("data-order");
    console.log(mode);
    var mode = parseInt(mode);

    if (mode == 0) {
        
        if (clickList[1] & clickList[2] & clickList[3] == 1) {
            clickList[0] = true;
            for (var i = 1; i < clickList.length; i++) {
                clickList[i] = false;
            }
        }
        else {
            clickList[0] = false;
            for (var i = 1; i < clickList.length; i++) {
                clickList[i] = true;
            }
        }
    }

    if (clickList[mode] == true) {
        console.log("current : ", clickList[mode]);
        hideMarkers(mode);
        clickList[mode] = false;
    }
    else {
        console.log("current : ", clickList[mode]);
        
        showMarkers(mode);
        clickList[mode] = true
    }


}